modifying readme.md
